
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Исполнители.Количество() > 1 И Объект.ПроектСогласован Тогда
		НесколькоИсполнителей = Истина;	
	КонецЕсли;
	Попытка
		Исполнитель = Объект.Исполнители[0].Сотрудник; 
	Исключение
		
	КОнецПопытки;
	ОбновитьПоляСогласования();
КонецПроцедуры

&НаКлиенте
Процедура ПроектСогласованПриИзменении(Элемент)
	ОбновитьПоляСогласования()
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоляСогласования()
	СогласованиеПроекта = Объект.ПроектСогласован;
	Если Не СогласованиеПроекта Тогда
		НесколькоИсполнителей = Ложь;
		НесколькоИсполнителейПриИзмененииНаСервере();
	КонецЕсли;
	Элементы.Исполнитель.Видимость = Не НесколькоИсполнителей;
	Элементы.НесколькоИсполнителей.Видимость = СогласованиеПроекта;
	Элементы.Руководитель.ОтметкаНезаполненного = СогласованиеПроекта;
	Элементы.Исполнитель.ОтметкаНезаполненного = СогласованиеПроекта;	
		
КонецПроцедуры

&НаКлиенте
Процедура НесколькоИсполнителейПриИзменении(Элемент)
	НесколькоИсполнителейПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НесколькоИсполнителейПриИзмененииНаСервере()
	Элементы.ГруппаИсполнители.Видимость = НесколькоИсполнителей;
	Элементы.Исполнитель.ОтметкаНезаполненного = НЕ НесколькоИсполнителей;
	Элементы.Исполнитель.Видимость = НЕ НесколькоИсполнителей;	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	Если Объект.Исполнители.Количество() > 0 Тогда
		Объект.Исполнители[0].Сотрудник = Исполнитель;
	Иначе
		Стр = Объект.Исполнители.Добавить();
		Стр.Сотрудник = Исполнитель;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ПроектСогласован И НЕ НесколькоИсполнителей Тогда
		ПроверяемыеРеквизиты.Добавить("Исполнитель");

	КонецЕсли;
	
КонецПроцедуры


